IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_periph_ac_regs.xml
<module id="PERIPH_AC_REGS" HW_revision="" description="PERIPH AC Registers">
	<register id="ADCA_AC" width="32" page="1" offset="0x0" internal="0" description="ADCA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCB_AC" width="32" page="1" offset="0x2" internal="0" description="ADCB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCC_AC" width="32" page="1" offset="0x4" internal="0" description="ADCC Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS1_AC" width="32" page="1" offset="0x10" internal="0" description="CMPSS1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS2_AC" width="32" page="1" offset="0x12" internal="0" description="CMPSS2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS3_AC" width="32" page="1" offset="0x14" internal="0" description="CMPSS3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS4_AC" width="32" page="1" offset="0x16" internal="0" description="CMPSS4 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="DACA_AC" width="32" page="1" offset="0x28" internal="0" description="DACA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="DACB_AC" width="32" page="1" offset="0x2a" internal="0" description="DACB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM1_AC" width="32" page="1" offset="0x48" internal="0" description="EPWM1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM2_AC" width="32" page="1" offset="0x4a" internal="0" description="EPWM2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM3_AC" width="32" page="1" offset="0x4c" internal="0" description="EPWM3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM4_AC" width="32" page="1" offset="0x4e" internal="0" description="EPWM4 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM5_AC" width="32" page="1" offset="0x50" internal="0" description="EPWM5 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM6_AC" width="32" page="1" offset="0x52" internal="0" description="EPWM6 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM7_AC" width="32" page="1" offset="0x54" internal="0" description="EPWM7 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM8_AC" width="32" page="1" offset="0x56" internal="0" description="EPWM8 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP1_AC" width="32" page="1" offset="0x70" internal="0" description="EQEP1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP2_AC" width="32" page="1" offset="0x72" internal="0" description="EQEP2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP1_AC" width="32" page="1" offset="0x80" internal="0" description="ECAP1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP2_AC" width="32" page="1" offset="0x82" internal="0" description="ECAP2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
