IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_periph_ac_regs.xml
	<register id="ECAP3_AC" width="32" page="1" offset="0x84" internal="0" description="ECAP3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SDFM1_AC" width="32" page="1" offset="0xa8" internal="0" description="SDFM1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SDFM2_AC" width="32" page="1" offset="0xaa" internal="0" description="SDFM2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB1_AC" width="32" page="1" offset="0xb0" internal="0" description="CLB1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB2_AC" width="32" page="1" offset="0xb2" internal="0" description="CLB2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB3_AC" width="32" page="1" offset="0xb4" internal="0" description="CLB3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB4_AC" width="32" page="1" offset="0xb6" internal="0" description="CLB4 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SCIA_AC" width="32" page="1" offset="0x100" internal="0" description="SCIA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SCIB_AC" width="32" page="1" offset="0x102" internal="0" description="SCIB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SPIA_AC" width="32" page="1" offset="0x110" internal="0" description="SPIA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SPIB_AC" width="32" page="1" offset="0x112" internal="0" description="SPIB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="I2CA_AC" width="32" page="1" offset="0x120" internal="0" description="I2CA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
