IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_periph_ac_regs.xml
	<register id="I2CB_AC" width="32" page="1" offset="0x122" internal="0" description="I2CB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="PMBUS_A_AC" width="32" page="1" offset="0x130" internal="0" description="PMBUSA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="LIN_A_AC" width="32" page="1" offset="0x138" internal="0" description="LINA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="LIN_B_AC" width="32" page="1" offset="0x13a" internal="0" description="LINB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="DCANA_AC" width="32" page="1" offset="0x140" internal="0" description="DCANA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="MCANA_AC" width="32" page="1" offset="0x148" internal="0" description="MCANA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIATX_AC" width="32" page="1" offset="0x158" internal="0" description="FSIA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIARX_AC" width="32" page="1" offset="0x15a" internal="0" description="FSIB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWM_A_AC" width="32" page="1" offset="0x1aa" internal="0" description="HRPWM Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="HIC_A_AC" width="32" page="1" offset="0x1ac" internal="0" description="HIC Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="AESA_AC" width="32" page="1" offset="0x1ae" internal="0" description="AES Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="PERIPH_AC_LOCK" width="32" page="1" offset="0x1fe" internal="0" description="Lock Register to stop Write access to peripheral Access register. ">
		<bitfield id="LOCK_AC_WR" description=" Lock control for Access control registers write." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
